OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/pic14/pic16regs.h
/*
 *
 * This file is generated automatically by the device-manager.pl program.
 *
 * Copyright (C) 2012-2016, Molnar Karoly <molnarkaroly@users.sf.net>
 *
 */

#ifndef __PIC16REGS_H__
#define __PIC16REGS_H__

#if defined(__SDCC_PIC10F320)
  #include <pic10f320.h>

#elif defined(__SDCC_PIC10F322)
  #include <pic10f322.h>

#elif defined(__SDCC_PIC10LF320)
  #include <pic10lf320.h>

#elif defined(__SDCC_PIC10LF322)
  #include <pic10lf322.h>

#elif defined(__SDCC_PIC12F609)
  #include <pic12f609.h>

#elif defined(__SDCC_PIC12F615)
  #include <pic12f615.h>

#elif defined(__SDCC_PIC12F617)
  #include <pic12f617.h>

#elif defined(__SDCC_PIC12F629)
  #include <pic12f629.h>

#elif defined(__SDCC_PIC12F635)
  #include <pic12f635.h>

#elif defined(__SDCC_PIC12F675)
  #include <pic12f675.h>

#elif defined(__SDCC_PIC12F683)
  #include <pic12f683.h>

#elif defined(__SDCC_PIC12F752)
  #include <pic12f752.h>

#elif defined(__SDCC_PIC12F1501)
  #include <pic12f1501.h>

#elif defined(__SDCC_PIC12F1571)
  #include <pic12f1571.h>

#elif defined(__SDCC_PIC12F1572)
  #include <pic12f1572.h>

#elif defined(__SDCC_PIC12F1612)
  #include <pic12f1612.h>

#elif defined(__SDCC_PIC12F1822)
  #include <pic12f1822.h>

#elif defined(__SDCC_PIC12F1840)
  #include <pic12f1840.h>

#elif defined(__SDCC_PIC12HV752)
  #include <pic12hv752.h>

#elif defined(__SDCC_PIC12LF1501)
  #include <pic12lf1501.h>

#elif defined(__SDCC_PIC12LF1552)
  #include <pic12lf1552.h>

#elif defined(__SDCC_PIC12LF1571)
  #include <pic12lf1571.h>

#elif defined(__SDCC_PIC12LF1572)
  #include <pic12lf1572.h>

#elif defined(__SDCC_PIC12LF1612)
  #include <pic12lf1612.h>

#elif defined(__SDCC_PIC12LF1822)
  #include <pic12lf1822.h>

#elif defined(__SDCC_PIC12LF1840)
  #include <pic12lf1840.h>

#elif defined(__SDCC_PIC12LF1840T39A)
  #include <pic12lf1840t39a.h>

#elif defined(__SDCC_PIC12LF1840T48A)
  #include <pic12lf1840t48a.h>

#elif defined(__SDCC_PIC16C62)
  #include <pic16c62.h>

#elif defined(__SDCC_PIC16C63A)
  #include <pic16c63a.h>

#elif defined(__SDCC_PIC16C65B)
  #include <pic16c65b.h>

#elif defined(__SDCC_PIC16C71)
  #include <pic16c71.h>

#elif defined(__SDCC_PIC16C72)
  #include <pic16c72.h>

#elif defined(__SDCC_PIC16C73B)
  #include <pic16c73b.h>

#elif defined(__SDCC_PIC16C74B)
  #include <pic16c74b.h>

#elif defined(__SDCC_PIC16C432)
  #include <pic16c432.h>

#elif defined(__SDCC_PIC16C433)
  #include <pic16c433.h>

#elif defined(__SDCC_PIC16C554)
  #include <pic16c554.h>

#elif defined(__SDCC_PIC16C557)
  #include <pic16c557.h>

#elif defined(__SDCC_PIC16C558)
  #include <pic16c558.h>

#elif defined(__SDCC_PIC16C620)
  #include <pic16c620.h>

#elif defined(__SDCC_PIC16C620A)
  #include <pic16c620a.h>

#elif defined(__SDCC_PIC16C621)
  #include <pic16c621.h>

#elif defined(__SDCC_PIC16C621A)
  #include <pic16c621a.h>

#elif defined(__SDCC_PIC16C622)
  #include <pic16c622.h>

#elif defined(__SDCC_PIC16C622A)
  #include <pic16c622a.h>

#elif defined(__SDCC_PIC16C710)
  #include <pic16c710.h>

#elif defined(__SDCC_PIC16C711)
  #include <pic16c711.h>

#elif defined(__SDCC_PIC16C715)
  #include <pic16c715.h>

#elif defined(__SDCC_PIC16C717)
  #include <pic16c717.h>

#elif defined(__SDCC_PIC16C745)
  #include <pic16c745.h>

#elif defined(__SDCC_PIC16C765)
  #include <pic16c765.h>

#elif defined(__SDCC_PIC16C770)
  #include <pic16c770.h>

#elif defined(__SDCC_PIC16C771)
  #include <pic16c771.h>

#elif defined(__SDCC_PIC16C773)
  #include <pic16c773.h>

#elif defined(__SDCC_PIC16C774)
  #include <pic16c774.h>

#elif defined(__SDCC_PIC16C781)
  #include <pic16c781.h>

#elif defined(__SDCC_PIC16C782)
  #include <pic16c782.h>

#elif defined(__SDCC_PIC16C925)
  #include <pic16c925.h>

#elif defined(__SDCC_PIC16C926)
  #include <pic16c926.h>

#elif defined(__SDCC_PIC16F72)
  #include <pic16f72.h>

#elif defined(__SDCC_PIC16F73)
  #include <pic16f73.h>

#elif defined(__SDCC_PIC16F74)
  #include <pic16f74.h>

#elif defined(__SDCC_PIC16F76)
  #include <pic16f76.h>

#elif defined(__SDCC_PIC16F77)
  #include <pic16f77.h>

#elif defined(__SDCC_PIC16F84)
  #include <pic16f84.h>

#elif defined(__SDCC_PIC16F84A)
  #include <pic16f84a.h>

#elif defined(__SDCC_PIC16F87)
  #include <pic16f87.h>

#elif defined(__SDCC_PIC16F88)
  #include <pic16f88.h>

#elif defined(__SDCC_PIC16F610)
  #include <pic16f610.h>

#elif defined(__SDCC_PIC16F616)
  #include <pic16f616.h>

#elif defined(__SDCC_PIC16F627)
  #include <pic16f627.h>

#elif defined(__SDCC_PIC16F627A)
  #include <pic16f627a.h>

#elif defined(__SDCC_PIC16F628)
  #include <pic16f628.h>

#elif defined(__SDCC_PIC16F628A)
  #include <pic16f628a.h>

#elif defined(__SDCC_PIC16F630)
  #include <pic16f630.h>

#elif defined(__SDCC_PIC16F631)
  #include <pic16f631.h>

#elif defined(__SDCC_PIC16F636)
  #include <pic16f636.h>

#elif defined(__SDCC_PIC16F639)
  #include <pic16f639.h>

#elif defined(__SDCC_PIC16F648A)
  #include <pic16f648a.h>

#elif defined(__SDCC_PIC16F676)
  #include <pic16f676.h>

#elif defined(__SDCC_PIC16F677)
  #include <pic16f677.h>

#elif defined(__SDCC_PIC16F684)
  #include <pic16f684.h>

#elif defined(__SDCC_PIC16F685)
  #include <pic16f685.h>

#elif defined(__SDCC_PIC16F687)
  #include <pic16f687.h>

#elif defined(__SDCC_PIC16F688)
  #include <pic16f688.h>

#elif defined(__SDCC_PIC16F689)
  #include <pic16f689.h>

#elif defined(__SDCC_PIC16F690)
  #include <pic16f690.h>

#elif defined(__SDCC_PIC16F707)
  #include <pic16f707.h>

#elif defined(__SDCC_PIC16F716)
  #include <pic16f716.h>

#elif defined(__SDCC_PIC16F720)
  #include <pic16f720.h>

#elif defined(__SDCC_PIC16F721)
  #include <pic16f721.h>

#elif defined(__SDCC_PIC16F722)
  #include <pic16f722.h>

#elif defined(__SDCC_PIC16F722A)
  #include <pic16f722a.h>

#elif defined(__SDCC_PIC16F723)
  #include <pic16f723.h>

#elif defined(__SDCC_PIC16F723A)
  #include <pic16f723a.h>

#elif defined(__SDCC_PIC16F724)
  #include <pic16f724.h>

#elif defined(__SDCC_PIC16F726)
  #include <pic16f726.h>

#elif defined(__SDCC_PIC16F727)
  #include <pic16f727.h>

#elif defined(__SDCC_PIC16F737)
  #include <pic16f737.h>

#elif defined(__SDCC_PIC16F747)
  #include <pic16f747.h>

#elif defined(__SDCC_PIC16F753)
  #include <pic16f753.h>

#elif defined(__SDCC_PIC16F767)
  #include <pic16f767.h>

#elif defined(__SDCC_PIC16F777)
  #include <pic16f777.h>

#elif defined(__SDCC_PIC16F785)
  #include <pic16f785.h>

#elif defined(__SDCC_PIC16F818)
  #include <pic16f818.h>

#elif defined(__SDCC_PIC16F819)
  #include <pic16f819.h>

#elif defined(__SDCC_PIC16F870)
  #include <pic16f870.h>

#elif defined(__SDCC_PIC16F871)
  #include <pic16f871.h>

#elif defined(__SDCC_PIC16F872)
  #include <pic16f872.h>

#elif defined(__SDCC_PIC16F873)
  #include <pic16f873.h>

#elif defined(__SDCC_PIC16F873A)
  #include <pic16f873a.h>

#elif defined(__SDCC_PIC16F874)
  #include <pic16f874.h>

#elif defined(__SDCC_PIC16F874A)
  #include <pic16f874a.h>

#elif defined(__SDCC_PIC16F876)
  #include <pic16f876.h>

#elif defined(__SDCC_PIC16F876A)
  #include <pic16f876a.h>

#elif defined(__SDCC_PIC16F877)
  #include <pic16f877.h>

#elif defined(__SDCC_PIC16F877A)
  #include <pic16f877a.h>

#elif defined(__SDCC_PIC16F882)
  #include <pic16f882.h>

#elif defined(__SDCC_PIC16F883)
  #include <pic16f883.h>

#elif defined(__SDCC_PIC16F884)
  #include <pic16f884.h>

#elif defined(__SDCC_PIC16F886)
  #include <pic16f886.h>

#elif defined(__SDCC_PIC16F887)
  #include <pic16f887.h>

#elif defined(__SDCC_PIC16F913)
  #include <pic16f913.h>

#elif defined(__SDCC_PIC16F914)
  #include <pic16f914.h>

#elif defined(__SDCC_PIC16F916)
  #include <pic16f916.h>

#elif defined(__SDCC_PIC16F917)
  #include <pic16f917.h>

#elif defined(__SDCC_PIC16F946)
  #include <pic16f946.h>

#elif defined(__SDCC_PIC16F1454)
  #include <pic16f1454.h>

#elif defined(__SDCC_PIC16F1455)
  #include <pic16f1455.h>

#elif defined(__SDCC_PIC16F1458)
  #include <pic16f1458.h>

#elif defined(__SDCC_PIC16F1459)
  #include <pic16f1459.h>

#elif defined(__SDCC_PIC16F1503)
  #include <pic16f1503.h>

#elif defined(__SDCC_PIC16F1507)
  #include <pic16f1507.h>

#elif defined(__SDCC_PIC16F1508)
  #include <pic16f1508.h>

#elif defined(__SDCC_PIC16F1509)
  #include <pic16f1509.h>

#elif defined(__SDCC_PIC16F1512)
  #include <pic16f1512.h>

#elif defined(__SDCC_PIC16F1513)
  #include <pic16f1513.h>

#elif defined(__SDCC_PIC16F1516)
  #include <pic16f1516.h>

#elif defined(__SDCC_PIC16F1517)
  #include <pic16f1517.h>

#elif defined(__SDCC_PIC16F1518)
  #include <pic16f1518.h>

#elif defined(__SDCC_PIC16F1519)
  #include <pic16f1519.h>

#elif defined(__SDCC_PIC16F1526)
  #include <pic16f1526.h>

#elif defined(__SDCC_PIC16F1527)
  #include <pic16f1527.h>

#elif defined(__SDCC_PIC16F1574)
  #include <pic16f1574.h>

#elif defined(__SDCC_PIC16F1575)
  #include <pic16f1575.h>

#elif defined(__SDCC_PIC16F1578)
  #include <pic16f1578.h>

#elif defined(__SDCC_PIC16F1579)
  #include <pic16f1579.h>

#elif defined(__SDCC_PIC16F1613)
  #include <pic16f1613.h>

#elif defined(__SDCC_PIC16F1614)
  #include <pic16f1614.h>

#elif defined(__SDCC_PIC16F1615)
  #include <pic16f1615.h>

#elif defined(__SDCC_PIC16F1618)
  #include <pic16f1618.h>

#elif defined(__SDCC_PIC16F1619)
  #include <pic16f1619.h>

#elif defined(__SDCC_PIC16F1703)
  #include <pic16f1703.h>

#elif defined(__SDCC_PIC16F1704)
  #include <pic16f1704.h>

#elif defined(__SDCC_PIC16F1705)
  #include <pic16f1705.h>

#elif defined(__SDCC_PIC16F1707)
  #include <pic16f1707.h>

#elif defined(__SDCC_PIC16F1708)
  #include <pic16f1708.h>

#elif defined(__SDCC_PIC16F1709)
  #include <pic16f1709.h>

#elif defined(__SDCC_PIC16F1713)
  #include <pic16f1713.h>

#elif defined(__SDCC_PIC16F1716)
  #include <pic16f1716.h>

#elif defined(__SDCC_PIC16F1717)
  #include <pic16f1717.h>

#elif defined(__SDCC_PIC16F1718)
  #include <pic16f1718.h>

#elif defined(__SDCC_PIC16F1719)
  #include <pic16f1719.h>

#elif defined(__SDCC_PIC16F1764)
  #include <pic16f1764.h>

#elif defined(__SDCC_PIC16F1765)
  #include <pic16f1765.h>

#elif defined(__SDCC_PIC16F1768)
  #include <pic16f1768.h>

#elif defined(__SDCC_PIC16F1769)
  #include <pic16f1769.h>

#elif defined(__SDCC_PIC16F1773)
  #include <pic16f1773.h>

#elif defined(__SDCC_PIC16F1776)
  #include <pic16f1776.h>

#elif defined(__SDCC_PIC16F1777)
  #include <pic16f1777.h>

#elif defined(__SDCC_PIC16F1778)
  #include <pic16f1778.h>

#elif defined(__SDCC_PIC16F1779)
  #include <pic16f1779.h>

#elif defined(__SDCC_PIC16F1782)
  #include <pic16f1782.h>

#elif defined(__SDCC_PIC16F1783)
  #include <pic16f1783.h>

#elif defined(__SDCC_PIC16F1784)
  #include <pic16f1784.h>

#elif defined(__SDCC_PIC16F1786)
  #include <pic16f1786.h>

#elif defined(__SDCC_PIC16F1787)
  #include <pic16f1787.h>

#elif defined(__SDCC_PIC16F1788)
  #include <pic16f1788.h>

#elif defined(__SDCC_PIC16F1789)
  #include <pic16f1789.h>

#elif defined(__SDCC_PIC16F1823)
  #include <pic16f1823.h>

#elif defined(__SDCC_PIC16F1824)
  #include <pic16f1824.h>

#elif defined(__SDCC_PIC16F1825)
  #include <pic16f1825.h>

#elif defined(__SDCC_PIC16F1826)
  #include <pic16f1826.h>

#elif defined(__SDCC_PIC16F1827)
  #include <pic16f1827.h>

#elif defined(__SDCC_PIC16F1828)
  #include <pic16f1828.h>

#elif defined(__SDCC_PIC16F1829)
  #include <pic16f1829.h>

#elif defined(__SDCC_PIC16F1829LIN)
  #include <pic16f1829lin.h>

#elif defined(__SDCC_PIC16F1847)
  #include <pic16f1847.h>

#elif defined(__SDCC_PIC16F1933)
  #include <pic16f1933.h>

#elif defined(__SDCC_PIC16F1934)
  #include <pic16f1934.h>

#elif defined(__SDCC_PIC16F1936)
  #include <pic16f1936.h>

#elif defined(__SDCC_PIC16F1937)
  #include <pic16f1937.h>

#elif defined(__SDCC_PIC16F1938)
  #include <pic16f1938.h>

#elif defined(__SDCC_PIC16F1939)
  #include <pic16f1939.h>

#elif defined(__SDCC_PIC16F1946)
  #include <pic16f1946.h>

#elif defined(__SDCC_PIC16F1947)
  #include <pic16f1947.h>

#elif defined(__SDCC_PIC16F18313)
  #include <pic16f18313.h>

#elif defined(__SDCC_PIC16F18323)
  #include <pic16f18323.h>

#elif defined(__SDCC_PIC16F18324)
  #include <pic16f18324.h>

#elif defined(__SDCC_PIC16F18325)
  #include <pic16f18325.h>

#elif defined(__SDCC_PIC16F18344)
  #include <pic16f18344.h>

#elif defined(__SDCC_PIC16F18345)
  #include <pic16f18345.h>

#elif defined(__SDCC_PIC16F18855)
  #include <pic16f18855.h>

#elif defined(__SDCC_PIC16F18875)
  #include <pic16f18875.h>

#elif defined(__SDCC_PIC16HV616)
  #include <pic16hv616.h>

#elif defined(__SDCC_PIC16HV753)
  #include <pic16hv753.h>

#elif defined(__SDCC_PIC16LF74)
  #include <pic16lf74.h>

#elif defined(__SDCC_PIC16LF76)
  #include <pic16lf76.h>

#elif defined(__SDCC_PIC16LF77)
  #include <pic16lf77.h>

#elif defined(__SDCC_PIC16LF84)
  #include <pic16lf84.h>

#elif defined(__SDCC_PIC16LF84A)
  #include <pic16lf84a.h>

#elif defined(__SDCC_PIC16LF87)
  #include <pic16lf87.h>

#elif defined(__SDCC_PIC16LF88)
  #include <pic16lf88.h>

#elif defined(__SDCC_PIC16LF627)
  #include <pic16lf627.h>

#elif defined(__SDCC_PIC16LF627A)
  #include <pic16lf627a.h>

#elif defined(__SDCC_PIC16LF628)
  #include <pic16lf628.h>

#elif defined(__SDCC_PIC16LF628A)
  #include <pic16lf628a.h>

#elif defined(__SDCC_PIC16LF648A)
  #include <pic16lf648a.h>

#elif defined(__SDCC_PIC16LF707)
  #include <pic16lf707.h>

#elif defined(__SDCC_PIC16LF720)
  #include <pic16lf720.h>

#elif defined(__SDCC_PIC16LF721)
  #include <pic16lf721.h>

#elif defined(__SDCC_PIC16LF722)
  #include <pic16lf722.h>

#elif defined(__SDCC_PIC16LF722A)
  #include <pic16lf722a.h>

#elif defined(__SDCC_PIC16LF723)
  #include <pic16lf723.h>

#elif defined(__SDCC_PIC16LF723A)
  #include <pic16lf723a.h>

#elif defined(__SDCC_PIC16LF724)
  #include <pic16lf724.h>

#elif defined(__SDCC_PIC16LF726)
  #include <pic16lf726.h>

#elif defined(__SDCC_PIC16LF727)
  #include <pic16lf727.h>

#elif defined(__SDCC_PIC16LF747)
  #include <pic16lf747.h>

#elif defined(__SDCC_PIC16LF767)
  #include <pic16lf767.h>

#elif defined(__SDCC_PIC16LF777)
  #include <pic16lf777.h>

#elif defined(__SDCC_PIC16LF818)
  #include <pic16lf818.h>

#elif defined(__SDCC_PIC16LF819)
  #include <pic16lf819.h>

#elif defined(__SDCC_PIC16LF870)
  #include <pic16lf870.h>

#elif defined(__SDCC_PIC16LF871)
  #include <pic16lf871.h>

#elif defined(__SDCC_PIC16LF872)
  #include <pic16lf872.h>

#elif defined(__SDCC_PIC16LF873)
  #include <pic16lf873.h>

#elif defined(__SDCC_PIC16LF873A)
  #include <pic16lf873a.h>

#elif defined(__SDCC_PIC16LF874)
  #include <pic16lf874.h>

#elif defined(__SDCC_PIC16LF874A)
  #include <pic16lf874a.h>

#elif defined(__SDCC_PIC16LF876)
  #include <pic16lf876.h>

#elif defined(__SDCC_PIC16LF876A)
  #include <pic16lf876a.h>

#elif defined(__SDCC_PIC16LF877)
  #include <pic16lf877.h>

#elif defined(__SDCC_PIC16LF877A)
  #include <pic16lf877a.h>

#elif defined(__SDCC_PIC16LF1454)
  #include <pic16lf1454.h>

#elif defined(__SDCC_PIC16LF1455)
  #include <pic16lf1455.h>

#elif defined(__SDCC_PIC16LF1458)
  #include <pic16lf1458.h>

#elif defined(__SDCC_PIC16LF1459)
  #include <pic16lf1459.h>

#elif defined(__SDCC_PIC16LF1503)
  #include <pic16lf1503.h>

#elif defined(__SDCC_PIC16LF1507)
  #include <pic16lf1507.h>

#elif defined(__SDCC_PIC16LF1508)
  #include <pic16lf1508.h>

#elif defined(__SDCC_PIC16LF1509)
  #include <pic16lf1509.h>

#elif defined(__SDCC_PIC16LF1512)
  #include <pic16lf1512.h>

#elif defined(__SDCC_PIC16LF1513)
  #include <pic16lf1513.h>

#elif defined(__SDCC_PIC16LF1516)
  #include <pic16lf1516.h>

#elif defined(__SDCC_PIC16LF1517)
  #include <pic16lf1517.h>

#elif defined(__SDCC_PIC16LF1518)
  #include <pic16lf1518.h>

#elif defined(__SDCC_PIC16LF1519)
  #include <pic16lf1519.h>

#elif defined(__SDCC_PIC16LF1526)
  #include <pic16lf1526.h>

#elif defined(__SDCC_PIC16LF1527)
  #include <pic16lf1527.h>

#elif defined(__SDCC_PIC16LF1554)
  #include <pic16lf1554.h>

#elif defined(__SDCC_PIC16LF1559)
  #include <pic16lf1559.h>

#elif defined(__SDCC_PIC16LF1566)
  #include <pic16lf1566.h>

#elif defined(__SDCC_PIC16LF1567)
  #include <pic16lf1567.h>

#elif defined(__SDCC_PIC16LF1574)
  #include <pic16lf1574.h>

#elif defined(__SDCC_PIC16LF1575)
  #include <pic16lf1575.h>

#elif defined(__SDCC_PIC16LF1578)
  #include <pic16lf1578.h>

#elif defined(__SDCC_PIC16LF1579)
  #include <pic16lf1579.h>

#elif defined(__SDCC_PIC16LF1613)
  #include <pic16lf1613.h>

#elif defined(__SDCC_PIC16LF1614)
  #include <pic16lf1614.h>

#elif defined(__SDCC_PIC16LF1615)
  #include <pic16lf1615.h>

#elif defined(__SDCC_PIC16LF1618)
  #include <pic16lf1618.h>

#elif defined(__SDCC_PIC16LF1619)
  #include <pic16lf1619.h>

#elif defined(__SDCC_PIC16LF1703)
  #include <pic16lf1703.h>

#elif defined(__SDCC_PIC16LF1704)
  #include <pic16lf1704.h>

#elif defined(__SDCC_PIC16LF1705)
  #include <pic16lf1705.h>

#elif defined(__SDCC_PIC16LF1707)
  #include <pic16lf1707.h>

#elif defined(__SDCC_PIC16LF1708)
  #include <pic16lf1708.h>

#elif defined(__SDCC_PIC16LF1709)
  #include <pic16lf1709.h>

#elif defined(__SDCC_PIC16LF1713)
  #include <pic16lf1713.h>

#elif defined(__SDCC_PIC16LF1716)
  #include <pic16lf1716.h>

#elif defined(__SDCC_PIC16LF1717)
  #include <pic16lf1717.h>

#elif defined(__SDCC_PIC16LF1718)
  #include <pic16lf1718.h>

#elif defined(__SDCC_PIC16LF1719)
  #include <pic16lf1719.h>

#elif defined(__SDCC_PIC16LF1764)
  #include <pic16lf1764.h>

#elif defined(__SDCC_PIC16LF1765)
  #include <pic16lf1765.h>

#elif defined(__SDCC_PIC16LF1768)
  #include <pic16lf1768.h>

#elif defined(__SDCC_PIC16LF1769)
  #include <pic16lf1769.h>

#elif defined(__SDCC_PIC16LF1773)
  #include <pic16lf1773.h>

#elif defined(__SDCC_PIC16LF1776)
  #include <pic16lf1776.h>

#elif defined(__SDCC_PIC16LF1777)
  #include <pic16lf1777.h>

#elif defined(__SDCC_PIC16LF1778)
  #include <pic16lf1778.h>

#elif defined(__SDCC_PIC16LF1779)
  #include <pic16lf1779.h>

#elif defined(__SDCC_PIC16LF1782)
  #include <pic16lf1782.h>

#elif defined(__SDCC_PIC16LF1783)
  #include <pic16lf1783.h>

#elif defined(__SDCC_PIC16LF1784)
  #include <pic16lf1784.h>

#elif defined(__SDCC_PIC16LF1786)
  #include <pic16lf1786.h>

#elif defined(__SDCC_PIC16LF1787)
  #include <pic16lf1787.h>

#elif defined(__SDCC_PIC16LF1788)
  #include <pic16lf1788.h>

#elif defined(__SDCC_PIC16LF1789)
  #include <pic16lf1789.h>

#elif defined(__SDCC_PIC16LF1823)
  #include <pic16lf1823.h>

#elif defined(__SDCC_PIC16LF1824)
  #include <pic16lf1824.h>

#elif defined(__SDCC_PIC16LF1824T39A)
  #include <pic16lf1824t39a.h>

#elif defined(__SDCC_PIC16LF1825)
  #include <pic16lf1825.h>

#elif defined(__SDCC_PIC16LF1826)
  #include <pic16lf1826.h>

#elif defined(__SDCC_PIC16LF1827)
  #include <pic16lf1827.h>

#elif defined(__SDCC_PIC16LF1828)
  #include <pic16lf1828.h>

#elif defined(__SDCC_PIC16LF1829)
  #include <pic16lf1829.h>

#elif defined(__SDCC_PIC16LF1847)
  #include <pic16lf1847.h>

#elif defined(__SDCC_PIC16LF1902)
  #include <pic16lf1902.h>

#elif defined(__SDCC_PIC16LF1903)
  #include <pic16lf1903.h>

#elif defined(__SDCC_PIC16LF1904)
  #include <pic16lf1904.h>

#elif defined(__SDCC_PIC16LF1906)
  #include <pic16lf1906.h>

#elif defined(__SDCC_PIC16LF1907)
  #include <pic16lf1907.h>

#elif defined(__SDCC_PIC16LF1933)
  #include <pic16lf1933.h>

#elif defined(__SDCC_PIC16LF1934)
  #include <pic16lf1934.h>

#elif defined(__SDCC_PIC16LF1936)
  #include <pic16lf1936.h>

#elif defined(__SDCC_PIC16LF1937)
  #include <pic16lf1937.h>

#elif defined(__SDCC_PIC16LF1938)
  #include <pic16lf1938.h>

#elif defined(__SDCC_PIC16LF1939)
  #include <pic16lf1939.h>

#elif defined(__SDCC_PIC16LF1946)
  #include <pic16lf1946.h>

#elif defined(__SDCC_PIC16LF1947)
  #include <pic16lf1947.h>

#elif defined(__SDCC_PIC16LF18313)
  #include <pic16lf18313.h>

#elif defined(__SDCC_PIC16LF18323)
  #include <pic16lf18323.h>

#elif defined(__SDCC_PIC16LF18324)
  #include <pic16lf18324.h>

#elif defined(__SDCC_PIC16LF18325)
  #include <pic16lf18325.h>

#elif defined(__SDCC_PIC16LF18344)
  #include <pic16lf18344.h>

#elif defined(__SDCC_PIC16LF18345)
  #include <pic16lf18345.h>

#elif defined(__SDCC_PIC16LF18855)
  #include <pic16lf18855.h>

#elif defined(__SDCC_PIC16LF18875)
  #include <pic16lf18875.h>

#else
  #error The sdcc is not supported by this processor!
#endif

#ifndef __CONCAT2
  #define __CONCAT2(a, b)       a##b
#endif

#ifndef __CONCAT
  #define __CONCAT(a, b)        __CONCAT2(a, b)
#endif

#define __CONFIG(address, value) \
    static const __code unsigned char __at(address) __CONCAT(_conf, __LINE__) = (value)

#define Nop()                   __asm nop __endasm
#define ClrWdt()                __asm clrwdt __endasm
#define Sleep()                 __asm sleep __endasm
#define Reset()                 __asm reset __endasm

    // To pointer manipulations. (From the sdcc/src/pic14/pcode.h file.)
#define GPTR_TAG_MASK           0x80    // Generated by the device-manager.pl program.
#define GPTR_TAG_DATA           0x00
#define GPTR_TAG_CODE           0x80

#endif // #ifndef __PIC16REGS_H__
